app/controllers/categories_controller.rb

SELECT "sous_categories".id FROM "sous_categories" WHERE "sous_categories"."category_id" = ?  [["category_id", 1]]
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page], per_page:5)