app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" LIMIT 1 OFFSET 0
---
  def index
    @categories = Category.all