app/controllers/fichiers_controller.rb

  def index
    @fichiers = Fichier.paginate(page: params[:page], per_page:5)
---
SELECT COUNT(*) FROM "fichiers"