app/controllers/fichiers_controller.rb

SELECT  "fichiers".* FROM "fichiers" LIMIT 1 OFFSET 0
---
  def index
    @fichiers = Fichier.all

INSERT INTO "fichiers" ("name", "category_id", "utilisateur_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "RockMusic"], ["category_id", 1], ["utilisateur_id", 1], ["created_at", "2016-05-04 09:21:59.499118"], ["updated_at", "2016-05-04 09:21:59.499118"]]
---
  def create
    @fichier = Fichier.new(fichier_params)

    respond_to do |format|
      if @fichier.save

UPDATE "fichiers" SET "file_updated_at" = ?, "file_file_name" = ?, "updated_at" = ? WHERE "fichiers"."id" = ?  [["file_updated_at", "2016-06-08 14:10:43.083315"], ["file_file_name", "wp.jpg"], ["updated_at", "2016-06-08 14:10:44.303002"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @fichier.update(fichier_params)

DELETE FROM "fichiers" WHERE "fichiers"."id" = ?  [["id", 2]]
---
  def destroy
    @fichier.destroy

SELECT  "fichiers".* FROM "fichiers" WHERE "fichiers"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_fichier
      @fichier = Fichier.find(params[:id])