app/controllers/roles_controller.rb

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Admin"], ["created_at", "2016-05-04 09:17:58.022874"], ["updated_at", "2016-05-04 09:17:58.022874"]]
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save