app/controllers/sous_categories_controller.rb

  def index
    @sous_categories = SousCategory.paginate(page: params[:page], per_page:5)
---
SELECT  "sous_categories".* FROM "sous_categories" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "sous_categories"

  def create
    @sous_category = SousCategory.new(sous_category_params)

    respond_to do |format|
      if @sous_category.save
---
INSERT INTO "sous_categories" ("nom", "categorie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nom", "Roman"], ["categorie_id", 2], ["created_at", "2016-04-29 19:59:08.502457"], ["updated_at", "2016-04-29 19:59:08.502457"]]

  def update
    respond_to do |format|
      if @sous_category.update(sous_category_params)
---
UPDATE "sous_categories" SET "categorie_id" = ?, "updated_at" = ? WHERE "sous_categories"."id" = ?  [["categorie_id", 1], ["updated_at", "2016-04-28 20:42:05.948864"], ["id", 1]]

  def destroy
    @sous_category.destroy
---
DELETE FROM "sous_categories" WHERE "sous_categories"."id" = ?  [["id", 1]]

    def set_sous_category
      @sous_category = SousCategory.find(params[:id])
---
SELECT  "sous_categories".* FROM "sous_categories" WHERE "sous_categories"."id" = ? LIMIT 1  [["id", 1]]