app/controllers/users_controller.rb

	def update
		@user = User.find(params[:id])
	    respond_to do |format|
		    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "delia@d.de"], ["updated_at", "2016-07-10 15:15:52.893549"], ["id", 1]]