app/controllers/utilisateurs_controller.rb

SELECT "utilisateurs".* FROM "utilisateurs"
---
  def index
    @utilisateurs = Utilisateur.all

INSERT INTO "utilisateurs" ("nom", "prenom", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nom", "testNom"], ["prenom", "testPrenom"], ["created_at", "2016-04-28 20:13:18.926530"], ["updated_at", "2016-04-28 20:13:18.926530"]]
---
  def create
    @utilisateur = Utilisateur.new(utilisateur_params)

    respond_to do |format|
      if @utilisateur.save

UPDATE "utilisateurs" SET "firstName" = ?, "updated_at" = ? WHERE "utilisateurs"."id" = ?  [["firstName", "Delia"], ["updated_at", "2016-05-04 09:55:44.644802"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @utilisateur.update(utilisateur_params)

DELETE FROM "utilisateurs" WHERE "utilisateurs"."id" = ?  [["id", 1]]
---
  def destroy
    @utilisateur.destroy

SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_utilisateur
      @utilisateur = Utilisateur.find(params[:id])